Revit 2027 API
ParameterTypeId.WindowTypeId Property
 "Type Mark"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WindowTypeId { get; }
Public Shared ReadOnly Property WindowTypeId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WindowTypeId {
	ForgeTypeId^ get ();
}
static member WindowTypeId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace